#!/usr/bin/ruby -Ku
require 'rubygems'
require 'kconv'
require  'pp'
#
mode = "1"        # 0 = おきかえ / 1 = 追加
#
phonetic = {
  "あ" => "a",
  "い" => "i",
  "う" => "M",
  "え" => "e",
  "お" => "o",
  "か" => "ka",
  "き" => "k'i",
  "く" => "kM",
  "け" => "ke",
  "こ" => "ko",
  "さ" => "sa",
  "し" => "Si",
  "す" => "sM",
  "せ" => "se",
  "そ" => "so",
  "た" => "ta",
  "ち" => "tSi",
  "つ" => "tsM",
  "て" => "te",
  "と" => "to",
  "な" => "na",
  "に" => "Ji",
  "ぬ" => "nM",
  "ね" => "ne",
  "の" => "no",
  "は" => "ha",
  "ひ" => "Ci",
  "ふ" => "p\\M",
  "へ" => "he",
  "ほ" => "ho",
  "ま" => "ma",
  "み" => "m'i",
  "む" => "mM",
  "め" => "me",
  "も" => "mo",
  "ら" => "4a",
  "り" => "4'i",
  "る" => "4M",
  "れ" => "4e",
  "ろ" => "4o",
  "が" => "ga",
  "ぎ" => "g'i",
  "ぐ" => "gM",
  "げ" => "ge",
  "ご" => "go",
  "ざ" => "dza",
  "じ" => "dZi",
  "ず" => "dzM",
  "ぜ" => "dze",
  "ぞ" => "dzo",
  "だ" => "da",
  "ぢ" => "dZi",
  "づ" => "dzM",
  "で" => "de",
  "ど" => "do",
  "ば" => "ba",
  "び" => "b'i",
  "ぶ" => "bM",
  "べ" => "be",
  "ぼ" => "bo",
  "ぱ" => "pa",
  "ぴ" => "p'i",
  "ぷ" => "pM",
  "ぺ" => "pe",
  "ぽ" => "po",
  "や" => "ja",
  "ゆ" => "jM",
  "よ" => "jo",
  "わ" => "wa",
  "ゐ" => "wi",
  "ゑ" => "we",
  "を" => "o",
  "ふぁ" => "p\\a",
  "つぁ" => "tsa",
  "うぃ" => "wi",
  "すぃ" => "si",
  "ずぃ" => "dzi",
  "つぃ" => "tsi",
  "てぃ" => "t'i",
  "でぃ" => "d'i",
  "ふぃ" => "p\\'i",
  "とぅ" => "tM",
  "どぅ" => "dM",
  "いぇ" => "je",
  "うぇ" => "we",
  "きぇ" => "k'e",
  "しぇ" => "Se",
  "ちぇ" => "tSe",
  "つぇ" => "tse",
  "てぇ" => "t'e",
  "にぇ" => "Je",
  "ひぇ" => "Ce",
  "みぇ" => "m'e",
  "りぇ" => "4'e",
  "ぎぇ" => "g'e",
  "じぇ" => "dZe",
  "でぇ" => "d'e",
  "びぇ" => "b'e",
  "ぴぇ" => "p'e",
  "ふぇ" => "p\\e",
  "うぉ" => "wo",
  "つぉ" => "tso",
  "ふぉ" => "p\\o",
  "きゃ" => "k'a",
  "しゃ" => "Sa",
  "ちゃ" => "tSa",
  "てゃ" => "t'a",
  "にゃ" => "Ja",
  "ひゃ" => "Ca",
  "みゃ" => "m'a",
  "りゃ" => "4'a",
  "ぎゃ" => "N'a",
  "じゃ" => "dZa",
  "でゃ" => "d'a",
  "びゃ" => "b'a",
  "ぴゃ" => "p'a",
  "ふゃ" => "p\\'a",
  "きゅ" => "k'M",
  "しゅ" => "SM",
  "ちゅ" => "tSM",
  "てゅ" => "t'M",
  "にゅ" => "JM",
  "ひゅ" => "CM",
  "みゅ" => "m'M",
  "りゅ" => "4'M",
  "ぎゅ" => "g'M",
  "じゅ" => "dZM",
  "でゅ" => "d'M",
  "びゅ" => "b'M",
  "ぴゅ" => "p'M",
  "ふゅ" => "p\\'M",
  "きょ" => "k'o",
  "しょ" => "So",
  "ちょ" => "tSo",
  "てょ" => "t'o",
  "にょ" => "Jo",
  "ひょ" => "Co",
  "みょ" => "m'o",
  "りょ" => "4'o",
  "ぎょ" => "N'o",
  "じょ" => "dZo",
  "でょ" => "d'o",
  "びょ" => "b'o",
  "ぴょ" => "p'o",
}

line_file = ARGV[0] if ARGV[0]

File.open(line_file,"r") do |file|
  file.each do |line|
    hatsuon = ""

    line = line.chomp.toutf8

    next if line =~ /^#/      # 先頭が#ならコメント

    buf = line.split(//)
    for i in (0...buf.size)
      next if buf[i] =~ /[ぁぃぅぇぉゃゅょ]/ 

      oto = buf[i]
      if i < buf.size && buf[i + 1] =~ /[ぁぃぅぇぉゃゅょ]/ 
        oto += buf[i + 1]
      end

# warn oto.tosjis

      hatsuon += phonetic[oto] + " " if phonetic.key?(oto)
    end

    hatsuon.rstrip!
    print "# 発音記号 #{hatsuon}\n"

    # SYS-EXに変換
    print "F0 43 79 09 00 50 1#{mode} \n"
    
    print "00 F7 \n"
  end
  print "\n"
end

